# running in divider/src/
read -formal divider.sv
prep -top divider

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
