# running in countones_synth/src/
read -formal countones.sv
prep -top countones_synth

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
