# running in multiplier/src/
read -formal multiplier.sv
prep -top multiplier

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
