# running in divider_synth/src/
read -formal divider.sv
prep -top divider_synth

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
