# running in multiplier_synth/src/
read -formal multiplier.sv
prep -top multiplier_synth

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
